
Функция ПроверкаИНН(ИНН, ЕстьОшибка, ТекстОшибки = "") Экспорт
	
	ПроверяемыйИНН = ИНН;
	
	Если ИНН = "" Тогда
		Возврат Истина;
	КонецЕсли; 
	
	ДлинаИНН = СтрДлина (ИНН);
	
	Для ИННСимвол = 1 По ДлинаИНН Цикл
		
		СимволИНН = Сред (ИНН,ИННСимвол, 1); 
		КодСимволаИНН = КодСимвола (СимволИНН);
		Если КодСимволаИНН < 48 Или КодСимволаИНН > 57 Тогда
			ТекстОшибки = "В ИНН должны быть только цифры";
			ЕстьОшибка = Истина;
			Возврат Ложь;
		КонецЕсли;	
			
	КонецЦикла;
	
	Если СтрДлина (ПроверяемыйИНН) = 10 Тогда
		ПроверяемаяЦифра = Число (Сред (ИНН, 10, 1));  
		МассивИНН = Новый Массив();
		
		Для Счетчик = 1 по 9 Цикл
			МассивИНН.Добавить(Сред (ПроверяемыйИНН, Счетчик, 1));
		КонецЦикла;
		
		КонтрольнаяСумма = 
		МассивИНН [0] * 2 +
		МассивИНН [1] * 4 +
		МассивИНН [2] * 10 +
		МассивИНН [3] * 3 +
		МассивИНН [4] * 5 +
		МассивИНН [5] * 9 +
		МассивИНН [6] * 4 +
		МассивИНН [7] * 6 +
		МассивИНН [8] * 8;
		
		КонтрольныйРазряд = КонтрольнаяСумма %11;
		
		Если КонтрольныйРазряд = 10 Тогда
			КонтрольныйРазряд = 0;
		КонецЕсли; 
		
		Если КонтрольныйРазряд <> ПроверяемаяЦифра Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	ИначеЕсли СтрДлина (ПроверяемыйИНН) = 12 Тогда
		ПроверяемаяЦифра = Число (Сред (ИНН, 12, 1));
		МассивИНН = Новый Массив();
		
		Для Счетчик = 1 по 11 Цикл
			МассивИНН.Добавить(Сред (ПроверяемыйИНН, Счетчик, 1));
		КонецЦикла;
		
		КонтрольнаяСумма10 = 
		МассивИНН [0] * 7 +
		МассивИНН [1] * 2 +
		МассивИНН [2] * 4 +
		МассивИНН [3] * 10 +
		МассивИНН [4] * 3 +
		МассивИНН [5] * 5 +
		МассивИНН [6] * 9 +
		МассивИНН [7] * 4 +
		МассивИНН [8] * 6 +
		МассивИНН [9] * 8;
		
		КонтрольныйРазряд11 = КонтрольнаяСумма10 %11;
		
		Если КонтрольныйРазряд11 = 10 Тогда
			КонтрольныйРазряд11 = 0;
		КонецЕсли;
		
		Если КонтрольныйРазряд11 <> МассивИНН [10] Тогда
			Возврат Ложь;
		КонецЕсли;
		
		КонтрольнаяСумма11 = 
		МассивИНН [0] * 3 +
		МассивИНН [1] * 7 +
		МассивИНН [2] * 2 +
		МассивИНН [3] * 4 +
		МассивИНН [4] * 10 +
		МассивИНН [5] * 3 +
		МассивИНН [6] * 5 +
		МассивИНН [7] * 9 +
		МассивИНН [8] * 4 +
		МассивИНН [9] * 6 +
		КонтрольныйРазряд11 * 8;
		
		КонтрольныйРазряд12 = КонтрольнаяСумма11 %11;
		
		Если КонтрольныйРазряд12 = 10 Тогда
			КонтрольныйРазряд12 = 0;
		КонецЕсли;
		
		Если КонтрольныйРазряд12 <> ПроверяемаяЦифра Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		ЕстьОшибка = Истина;
		ТекстОшибки = "В ИНН некоректная длина";
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции