
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Тип = ПредопределенноеЗначение("Перечисление.ТипКонтрогента.ЮридическоеЛицо");
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;

КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ДлинаИНН = СтрДлина (ИНН);
	ДлинаКПП = СтрДлина (КПП);
	
	Для ИННСимвол = 1 По ДлинаИНН Цикл
		
		СимволИНН = Сред (ИНН,ИННСимвол, 1); 
		КодСимволаИНН = КодСимвола (СимволИНН);
		Если КодСимволаИНН < 48 Или КодСимволаИНН > 57 Тогда
			Сообщить ("В ИНН присутствуют пробелы или другие недопустимые символы");
			Отказ = Истина;
		КонецЕсли;	
			
	КонецЦикла;   
	
	Для КППСимвол = 1 По ДлинаКПП Цикл
		
		СимволКПП = Сред (КПП,КППСимвол, 1); 
		КодСимволаКПП = КодСимвола (СимволКПП);
		Если КодСимволаКПП < 48 Или КодСимволаКПП > 57 Тогда
			Сообщить ("В КПП присутствуют пробелы или другие недопустимые символы");
			Отказ = Истина;
		КонецЕсли;	
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
