
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);
	
	Если НЕ Пользователь = Неопределено Тогда
		ВходРазрешен = Пользователь.АутентификацияСтандартная;
		ИмяДляВхода = Пользователь.Имя;
		Пароль = Пользователь.СохраняемоеЗначениеПароля;
		Элементы.Пароль.РежимПароля = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторПользователяИБ);

	Если Пользователь <> Неопределено Тогда
		Пользователь.АутентификацияСтандартная = Истина;
		Пользователь.Имя = ИмяДляВхода;
		Пользователь.Записать();
	ИначеЕсли ВходРазрешен Тогда
	    НовыйПользователь  = ПользователиИнформационнойБазы.СоздатьПользователя();
	    НовыйПользователь.Имя = ИмяДляВхода;
	    НовыйПользователь.СохраняемоеЗначениеПароля = Пароль;
	    НовыйПользователь.Роли.Добавить(Метаданные.Роли.БазовыеПрава);
	    НовыйПользователь.ПоказыватьВСпискеВыбора = Истина;
	    НовыйПользователь.АутентификацияСтандартная = Истина;
	    НовыйПользователь.Записать();
	    ТекущийОбъект.ИдентификаторПользователяИБ = НовыйПользователь.УникальныйИдентификатор;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СлучайныйПароль(Команда)
	
	Пароль = СоздатьНовыйПароль();
	
	Если Элементы.Пароль.РежимПароля = Истина Тогда
		Элементы.Пароль.РежимПароля = Ложь;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция СоздатьНовыйПароль ()
	
	 Генератор = Новый ГенераторСлучайныхПаролей;
	 
	 НовыйПароль = Лев(Генератор.СлучайныйПароль(10,), 6);
	 Возврат НовыйПароль;
	
КонецФункции

#КонецОбласти
